In [7]:
try:
    b=open("data.csv","x")
    b.close
except:
    print("the file if already here")

In [10]:
import csv
csvfile=open("data.csv")
reader=csv.DictReader(csvfile)
for row in reader:
    print(row)

{'Name': 'ram', 'Age': '15', 'Address': 'ktm', 'Phone': '456465646'}
{'Name': 'raaaam', 'Age': '15', 'Address': 'ktm', 'Phone': '45646564665'}
{'Name': 'raam', 'Age': '15', 'Address': 'ktm', 'Phone': '45646564656'}
{'Name': 'raaaam', 'Age': '15', 'Address': 'ktm', 'Phone': '4564656461231'}

In [11]:
import pandas as pd
df=pd.read_csv("data.csv")
df

     Name  Age Address          Phone
0     ram   15     ktm      456465646
1  raaaam   15     ktm    45646564665
2    raam   15     ktm    45646564656
3  raaaam   15     ktm  4564656461231

In [14]:
import pandas as pd
df=pd.read_csv("data.csv",nrows=2)
df

     Name  Age Address        Phone
0     ram   15     ktm    456465646
1  raaaam   15     ktm  45646564665

In [28]:
import pandas as pd
df=pd.read_csv("data.csv")
# df.head(4)
df.tail(2)

   sn      Name  Age Address          Phone
3   4    raaaam   15     ktm  4564656461231
4   5  ra56aaam   15     ktm  4564656461231

In [21]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="sn")
df

      Name  Age Address          Phone
sn
1      ram   15     ktm      456465646
2   raaaam   15     ktm    45646564665
3     raam   15     ktm    45646564656
4   raaaam   15     ktm  4564656461231

In [31]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="sn")
df.iloc[0:4,0:2]

      Name  Age
sn
1      ram   15
2   raaaam   15
3     raam   15
4   raaaam   15

In [26]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="sn")
df.loc[1:5]

SyntaxError: invalid syntax (<ipython-input-26-f70ae3886c42>, line 3)

In [35]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="sn")
df[df["Age"]<32]

        Name  Age Address          Phone
sn
1        ram   15     ktm      456465646
2     raaaam   15     ktm    45646564665
3       raam   15     ktm    45646564656
4     raaaam   15     ktm  4564656461231
5   ra56aaam   15     ktm  4564656461231

In [48]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="Name")
df[df["sn"]==2]

        sn  Age Address        Phone
Name
raaaam   2   15     ktm  45646564665

In [43]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="sn",usecols=["sn","Name"])
df

        Name
sn
1        ram
2     raaaam
3       raam
4     raaaam
5   ra56aaam

In [55]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="sn")
df1=df[(df["Age"]<20)&(df["Address"]=="ktm")]
df1.to_csv("df1.csv")
df1

        Name  Age Address          Phone
sn
1        ram   15     ktm      456465646
2     raaaam   15     ktm    45646564665
3       raam   15     ktm    45646564656
4     raaaam   15     ktm  4564656461231
5   ra56aaam   15     ktm  4564656461231

In [59]:
import csv
fields=[7,"Hari",78,"ktm",45654]
f=open("books.csv","a")
x=csv.writer(f)
x.writerow(fields)
f.close()

In [61]:
# dictwriter()
# Dataframe()

NameError: name 'dictwriter' is not defined